RT-Thread/rt-thread/bsp/at32/libraries/f435_437/firmware/drivers/src/at32f435_437_edma.c
/**
  **************************************************************************
  * @file     at32f435_437_edma.c
  * @version  v2.0.7
  * @date     2022-04-02
  * @brief    contains all the functions for the edma firmware library
  **************************************************************************
  *                       Copyright notice & Disclaimer
  *
  * The software Board Support Package (BSP) that is made available to
  * download from Artery official website is the copyrighted work of Artery.
  * Artery authorizes customers to use, copy, and distribute the BSP
  * software and its related documentation for the purpose of design and
  * development in conjunction with Artery microcontrollers. Use of the
  * software is governed by this copyright notice and the following disclaimer.
  *
  * THIS SOFTWARE IS PROVIDED ON "AS IS" BASIS WITHOUT WARRANTIES,
  * GUARANTEES OR REPRESENTATIONS OF ANY KIND. ARTERY EXPRESSLY DISCLAIMS,
  * TO THE FULLEST EXTENT PERMITTED BY LAW, ALL EXPRESS, IMPLIED OR
  * STATUTORY OR OTHER WARRANTIES, GUARANTEES OR REPRESENTATIONS,
  * INCLUDING BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,
  * FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
  *
  **************************************************************************
  */

#include "at32f435_437_conf.h"

/** @addtogroup AT32F435_437_periph_driver
  * @{
  */

/** @defgroup EDMA
  * @brief EDMA driver modules
  * @{
  */

#ifdef EDMA_MODULE_ENABLED

/** @defgroup EDMA_private_functions
  * @{
  */

/**
  * @brief  reset edma_streamx channely register.
  * @param  edma_streamx:
  *         this parameter can be one of the following values:
  *         - EDMA_STREAM1
  *         - EDMA_STREAM2
  *         - EDMA_STREAM3
  *         - EDMA_STREAM4
  *         - EDMA_STREAM5
  *         - EDMA_STREAM6
  *         - EDMA_STREAM7
  *         - EDMA_STREAM8
  * @retval none.
  */
void edma_reset(edma_stream_type *edma_streamx)
{
  /* reset registers for the selected stream */
  edma_streamx->ctrl_bit.sen = FALSE;
  edma_streamx->ctrl = 0x0;
  edma_streamx->dtcnt = 0x0;
  edma_streamx->paddr = 0x0;
  edma_streamx->m0addr = 0x0;
  edma_streamx->m1addr = 0x0;
  edma_streamx->fctrl = (uint32_t)0x00000021;

  /* reset interrupt pending bits for the selected stream */
  switch((uint32_t)edma_streamx)
  {
    case EDMA_STREAM1_BASE:
      EDMA->clr1 = EDMA_STREAM1_INT_MASK;
      break;
    case EDMA_STREAM2_BASE:
      EDMA->clr1 = EDMA_STREAM2_INT_MASK;
      break;
    case EDMA_STREAM3_BASE:
      EDMA->clr1 = EDMA_STREAM3_INT_MASK;
      break;
    case EDMA_STREAM4_BASE:
      EDMA->clr1 = EDMA_STREAM4_INT_MASK;
      break;
    case EDMA_STREAM5_BASE:
      EDMA->clr2 = EDMA_STREAM5_INT_MASK;
      break;
    case EDMA_STREAM6_BASE:
      EDMA->clr2 = EDMA_STREAM6_INT_MASK;
      break;
    case EDMA_STREAM7_BASE:
      EDMA->clr2 = EDMA_STREAM7_INT_MASK;
      break;
    case EDMA_STREAM8_BASE:
      EDMA->clr2 = EDMA_STREAM8_INT_MASK;
      break;
    default: break;
  }
}

/**
  * @brief  edma init.
  * @param  edma_streamx:
  *         this parameter can be one of the following values:
  *         - EDMA_STREAM1
  *         - EDMA_STREAM2
  *         - EDMA_STREAM3
  *         - EDMA_STREAM4
  *         - EDMA_STREAM5
  *         - EDMA_STREAM6
  *         - EDMA_STREAM7
  *         - EDMA_STREAM8
  * @param  edma_init_struct: pointer to a edma_init_type structure.
  * @retval none.
  */
void edma_init(edma_stream_type *edma_streamx, edma_init_type *edma_init_struct)
{
  /* config dtd bits */
  edma_streamx->ctrl_bit.dtd = edma_init_struct->direction;

  /* config pincm bit */
  edma_streamx->ctrl_bit.pincm = edma_init_struct->peripheral_inc_enable;

  /* config mincm bit*/
  edma_streamx->ctrl_bit.mincm = edma_init_struct->memory_inc_enable;

  /* config pwidth bits */
  edma_streamx->ctrl_bit.pwidth = edma_init_struct->peripheral_data_width;

  /* config mwidth bits */
  edma_streamx->ctrl_bit.mwidth = edma_init_struct->memory_data_width;

  /* config lm bit */
  edma_streamx->ctrl_bit.lm = edma_init_struct->loop_mode_enable;

  /* config spl bits */
  edma_streamx->ctrl_bit.spl = edma_init_struct->priority;

  /* config mct bits */
  edma_streamx->ctrl_bit.mct = edma_init_struct->memory_burst_mode;

  /* config pct bits */
  edma_streamx->ctrl_bit.pct = edma_init_struct->peripheral_burst_mode;

  /* config fen bits */
  edma_streamx->fctrl_bit.fen = edma_init_struct->fifo_mode_enable;

  /* config fthsel bits*/
  edma_streamx->fctrl_bit.fthsel = edma_init_struct->fifo_threshold;

  /* config dtcnt */
  edma_streamx->dtcnt = edma_init_struct->buffer_size;

  /* config paddr */
  edma_streamx->paddr = edma_init_struct->peripheral_base_addr;

  /* config m0addr */
  edma_streamx->m0addr = edma_init_struct->memory0_base_addr;
}

/**
  * @brief  edma init struct config with its default value.
  * @param  edma_init_struct: pointer to a edma_init_type structure which will be initialized.
  * @retval none.
  */
void edma_default_para_init(edma_init_type *edma_init_struct)
{
  edma_init_struct->buffer_size = 0;
  edma_init_struct->loop_mode_enable = FALSE;
  edma_init_struct->direction = EDMA_DIR_PERIPHERAL_TO_MEMORY;
  edma_init_struct->fifo_threshold = EDMA_FIFO_THRESHOLD_1QUARTER;
  edma_init_struct->fifo_mode_enable = FALSE;
  edma_init_struct->memory0_base_addr = 0;
  edma_init_struct->memory_burst_mode = EDMA_MEMORY_SINGLE;
  edma_init_struct->memory_data_width = EDMA_MEMORY_DATA_WIDTH_BYTE;
  edma_init_struct->memory_inc_enable = FALSE;
  edma_init_struct->peripheral_base_addr = 0;
  edma_init_struct->peripheral_burst_mode = EDMA_PERIPHERAL_SINGLE;
  edma_init_struct->peripheral_data_width = EDMA_PERIPHERAL_DATA_WIDTH_BYTE;
  edma_init_struct->peripheral_inc_enable = FALSE;
  edma_init_struct->priority = EDMA_PRIORITY_LOW;
}

/**
  * @brief  enable or disable the edma streamx.
  * @param  edma_streamx:
  *         this parameter can be one of the following values:
  *         - EDMA_STREAM1
  *         - EDMA_STREAM2
  *         - EDMA_STREAM3
  *         - EDMA_STREAM4
  *         - EDMA_STREAM5
  *         - EDMA_STREAM6
  *         - EDMA_STREAM7
  *         - EDMA_STREAM8
  * @param  new_state (TRUE or FALSE).
  * @retval none.
  */
void edma_stream_enable(edma_stream_type *edma_streamx, confirm_state new_state)
{
  edma_streamx->ctrl_bit.sen = new_state;
}

/**
  * @brief  enable or disable the edma streamx interrupts.
  * @param  edma_streamx:
  *         this parameter can be one of the following values:
  *         - EDMA_STREAM1
  *         - EDMA_STREAM2
  *         - EDMA_STREAM3
  *         - EDMA_STREAM4
  *         - EDMA_STREAM5
  *         - EDMA_STREAM6
  *         - EDMA_STREAM7
  *         - EDMA_STREAM8
  * @param  edma_int:
  *         this parameter can be one of the following values:
  *         - EDMA_FDT_INT
  *         - EDMA_HDT_INT
  *         - EDMA_DTERR_INT
  *         - EDMA_DMERR_INT
  *         - EDMA_FERR_INT
  * @param  new_state (TRUE or FALSE).
  * @retval none.
  */
void edma_interrupt_enable(edma_stream_type *edma_streamx, uint32_t edma_int, confirm_state new_state)
{
  if((edma_int & EDMA_FERR_INT) != 0)
  {
    if(new_state != FALSE)
    {
      edma_streamx->fctrl |= (uint32_t)EDMA_FERR_INT;
    }
    else
    {
      edma_streamx->fctrl &= ~(uint32_t)EDMA_FERR_INT;
    }
  }

  if(edma_int != EDMA_FERR_INT)
  {
    if(new_state != FALSE)
    {
      edma_streamx->ctrl |= (uint32_t)edma_int;
    }
    else
    {
      edma_streamx->ctrl &= ~(uint32_t)edma_int;
    }
  }
}

/**
  * @brief  config the edma peripheral increment offset size mode.
  * @param  edma_streamx:
  *         this parameter can be one of the following values:
  *         - EDMA_STREAM1
  *         - EDMA_STREAM2
  *         - EDMA_STREAM3
  *         - EDMA_STREAM4
  *         - EDMA_STREAM5
  *         - EDMA_STREAM6
  *         - EDMA_STREAM7
  *         - EDMA_STREAM8
  * @param  offset: peripheral increment offset size.
  *         this parameter can be one of the following values:
  *         - EDMA_PERIPHERAL_INC_PSIZE
  *         - EDMA_PERIPHERAL_INC_4_BYTE
  * @retval none.
  */
void edma_peripheral_inc_offset_set(edma_stream_type *edma_streamx, edma_peripheral_inc_offset_type offset)
{
  edma_streamx->ctrl_bit.pincos = offset;
}

/**
  * @brief  enable or disable the edma streamx flow controller.
  * @param  edma_streamx:
  *         this parameter can be one of the following values:
  *         - EDMA_STREAM1
  *         - EDMA_STREAM2
  *         - EDMA_STREAM3
  *         - EDMA_STREAM4
  *         - EDMA_STREAM5
  *         - EDMA_STREAM6
  *         - EDMA_STREAM7
  *         - EDMA_STREAM8
  * @param  new_state (TRUE or FALSE).
  * @retval none.
  */
void edma_flow_controller_enable(edma_stream_type *edma_streamx, confirm_state new_state)
{
  edma_streamx->ctrl_bit.pfctrl = new_state;
}

/**
  * @brief  set the number of data to be transferred.
  * @param  edma_streamx:
  *         this parameter can be one of the following values:
  *         - EDMA_STREAM1
  *         - EDMA_STREAM2
  *         - EDMA_STREAM3
  *         - EDMA_STREAM4
  *         - EDMA_STREAM5
  *         - EDMA_STREAM6
  *         - EDMA_STREAM7
  *         - EDMA_STREAM8
  * @param  data_number: the number of data to be transferred (0x0000~0xFFFF).
  * @retval none.
  */
void edma_data_number_set(edma_stream_type *edma_streamx, uint16_t data_number)
{
  /* write the number of data units to be transferred */
  edma_streamx->dtcnt = data_number;
}

/**
  * @brief  get the number of data to be transferred.
  * @param  edma_streamx:
  *         this parameter can be one of the following values:
  *         - EDMA_STREAM1
  *         - EDMA_STREAM2
  *         - EDMA_STREAM3
  *         - EDMA_STREAM4
  *         - EDMA_STREAM5
  *         - EDMA_STREAM6
  *         - EDMA_STREAM7
  *         - EDMA_STREAM8
  * @retval the number value.
  */
uint16_t edma_data_number_get(edma_stream_type *edma_streamx)
{
  return ((uint16_t)(edma_streamx->dtcnt));
}

/**
  * @brief  config the the double buffer mode.
  * @param  edma_streamx:
  *         this parameter can be one of the following values:
  *         - EDMA_STREAM1
  *         - EDMA_STREAM2
  *         - EDMA_STREAM3
  *         - EDMA_STREAM4
  *         - EDMA_STREAM5
  *         - EDMA_STREAM6
  *         - EDMA_STREAM7
  *         - EDMA_STREAM8
  * @param  memory1_addr: the address of the second buffer.
  * @param  current_memory: specifies the target area of the first transfer.
  *         this parameter can be one of the following values:
  *         - EDMA_MEMORY_0
  *         - EDMA_MEMORY_1
  * @retval none.
  */
void edma_double_buffer_mode_init(edma_stream_type *edma_streamx, uint32_t memory1_addr, edma_memory_type current_memory)
{
  if(current_memory != EDMA_MEMORY_0)
  {
    edma_streamx->ctrl_bit.cm = 1;
  }
  else
  {
    edma_streamx->ctrl_bit.cm = 0;
  }

