RT-Thread/rt-thread/bsp/at32/libraries/f435_437/firmware/drivers/src/at32f435_437_edma.c
  edma_streamx->m1addr = memory1_addr;
}

/**
  * @brief  enable or disable the double memory mode.
  * @param  edma_streamx:
  *         this parameter can be one of the following values:
  *         - EDMA_STREAM1
  *         - EDMA_STREAM2
  *         - EDMA_STREAM3
  *         - EDMA_STREAM4
  *         - EDMA_STREAM5
  *         - EDMA_STREAM6
  *         - EDMA_STREAM7
  *         - EDMA_STREAM8
  * @param  new_state (TRUE or FALSE).
  * @retval none.
  */
void edma_double_buffer_mode_enable(edma_stream_type *edma_streamx, confirm_state new_state)
{
  if(new_state != FALSE)
  {
    edma_streamx->ctrl_bit.dmm = 1;
  }
  else
  {
    edma_streamx->ctrl_bit.dmm = 0;
  }
}

/**
  * @brief  config the memory address in double buffer mode.
  * @param  edma_streamx:
  *         this parameter can be one of the following values:
  *         - EDMA_STREAM1
  *         - EDMA_STREAM2
  *         - EDMA_STREAM3
  *         - EDMA_STREAM4
  *         - EDMA_STREAM5
  *         - EDMA_STREAM6
  *         - EDMA_STREAM7
  *         - EDMA_STREAM8
  * @param  memory_addr: the address of the buffer.
  * @param  memory_target: indicates the which memory addr register will be config.
  *         this parameter can be one of the following values:
  *         - EDMA_MEMORY_0
  *         - EDMA_MEMORY_1
  * @retval none.
  */
void edma_memory_addr_set(edma_stream_type *edma_streamx, uint32_t memory_addr, uint32_t memory_target)
{
  if(memory_target != EDMA_MEMORY_0)
  {
    edma_streamx->m1addr = memory_addr;
  }
  else
  {
    edma_streamx->m0addr = memory_addr;
  }
}

/**
  * @brief  get the current memory target.
  * @param  edma_streamx:
  *         this parameter can be one of the following values:
  *         - EDMA_STREAM1
  *         - EDMA_STREAM2
  *         - EDMA_STREAM3
  *         - EDMA_STREAM4
  *         - EDMA_STREAM5
  *         - EDMA_STREAM6
  *         - EDMA_STREAM7
  *         - EDMA_STREAM8
  * @retval the memory target
  *         - EDMA_MEMORY_0
  *         - EDMA_MEMORY_1
  */
edma_memory_type edma_memory_target_get(edma_stream_type *edma_streamx)
{
  return (edma_memory_type)(edma_streamx->ctrl_bit.cm);
}

/**
  * @brief  get the enable status of edma streamx.
  * @param  edma_streamx:
  *         this parameter can be one of the following values:
  *         - EDMA_STREAM1
  *         - EDMA_STREAM2
  *         - EDMA_STREAM3
  *         - EDMA_STREAM4
  *         - EDMA_STREAM5
  *         - EDMA_STREAM6
  *         - EDMA_STREAM7
  *         - EDMA_STREAM8
  * @retval current state of the edma streamx (SET or RESET).
  */
flag_status edma_stream_status_get(edma_stream_type *edma_streamx)
{
  if((edma_streamx->ctrl_bit.sen) != RESET)
  {
    return SET;
  }
  else
  {
    return RESET;
  }
}

/**
  * @brief  get the fifo level status.
  * @param  edma_streamx:
  *         this parameter can be one of the following values:
  *         - EDMA_STREAM1
  *         - EDMA_STREAM2
  *         - EDMA_STREAM3
  *         - EDMA_STREAM4
  *         - EDMA_STREAM5
  *         - EDMA_STREAM6
  *         - EDMA_STREAM7
  *         - EDMA_STREAM8
  * @retval the fifo filling state.
  *         - EDMA_FIFO_STATUS_LESS_1QUARTER: (0)   <  fifo level < (1/4).
  *         - EDMA_FIFO_STATUS_1QUARTER:      (1/4) <= fifo level < (1/2) .
  *         - EDMA_FIFO_STATUS_HALF:          (1/2) <= fifo level < (3/4).
  *         - EDMA_FIFO_STATUS_3QUARTER:      (3/4) <= fifo level < (1).
  *         - EDMA_FIFO_STATUS_EMPTY: fifo is empty.
  *         - EDMA_FIFO_STATUS_FULL: fifo is full.
  */
uint8_t edma_fifo_status_get(edma_stream_type *edma_streamx)
{
  return (uint8_t)(edma_streamx->fctrl_bit.fsts);
}

/**
  * @brief  get the edma flag.
  * @param  edma_flag:
  *         this parameter can be one of the following values:
  *         - EDMA_FERR1_FLAG   - EDMA_DMERR1_FLAG  - EDMA_DTERR1_FLAG  - EDMA_HDT1_FLAG   - EDMA_FDT1_FLAG
  *         - EDMA_FERR2_FLAG   - EDMA_DMERR2_FLAG  - EDMA_DTERR2_FLAG  - EDMA_HDT2_FLAG   - EDMA_FDT2_FLAG
  *         - EDMA_FERR3_FLAG   - EDMA_DMERR3_FLAG  - EDMA_DTERR3_FLAG  - EDMA_HDT3_FLAG   - EDMA_FDT3_FLAG
  *         - EDMA_FERR4_FLAG   - EDMA_DMERR4_FLAG  - EDMA_DTERR4_FLAG  - EDMA_HDT4_FLAG   - EDMA_FDT4_FLAG
  *         - EDMA_FERR5_FLAG   - EDMA_DMERR5_FLAG  - EDMA_DTERR5_FLAG  - EDMA_HDT5_FLAG   - EDMA_FDT5_FLAG
  *         - EDMA_FERR6_FLAG   - EDMA_DMERR6_FLAG  - EDMA_DTERR6_FLAG  - EDMA_HDT6_FLAG   - EDMA_FDT6_FLAG
  *         - EDMA_FERR7_FLAG   - EDMA_DMERR7_FLAG  - EDMA_DTERR7_FLAG  - EDMA_HDT7_FLAG   - EDMA_FDT7_FLAG
  *         - EDMA_FERR8_FLAG   - EDMA_DMERR8_FLAG  - EDMA_DTERR8_FLAG  - EDMA_HDT8_FLAG   - EDMA_FDT8_FLAG
  * @retval the new state of edma flag (SET or RESET).
  */
flag_status edma_flag_get(uint32_t edma_flag)
{
  uint32_t status;

  if(edma_flag > ((uint32_t)0x20000000))
  {
    status = EDMA->sts2;
  }
  else
  {
    status = EDMA->sts1;
  }

  if((status & edma_flag) != ((uint32_t)RESET))
  {
    return SET;
  }
  else
  {
    return RESET;
  }
}

/**
  * @brief  clear the edma flag.
  * @param  edma_flag:
  *         this parameter can be one of the following values:
  *         - EDMA_FERR1_FLAG   - EDMA_DMERR1_FLAG  - EDMA_DTERR1_FLAG  - EDMA_HDT1_FLAG   - EDMA_FDT1_FLAG
  *         - EDMA_FERR2_FLAG   - EDMA_DMERR2_FLAG  - EDMA_DTERR2_FLAG  - EDMA_HDT2_FLAG   - EDMA_FDT2_FLAG
  *         - EDMA_FERR3_FLAG   - EDMA_DMERR3_FLAG  - EDMA_DTERR3_FLAG  - EDMA_HDT3_FLAG   - EDMA_FDT3_FLAG
  *         - EDMA_FERR4_FLAG   - EDMA_DMERR4_FLAG  - EDMA_DTERR4_FLAG  - EDMA_HDT4_FLAG   - EDMA_FDT4_FLAG
  *         - EDMA_FERR5_FLAG   - EDMA_DMERR5_FLAG  - EDMA_DTERR5_FLAG  - EDMA_HDT5_FLAG   - EDMA_FDT5_FLAG
  *         - EDMA_FERR6_FLAG   - EDMA_DMERR6_FLAG  - EDMA_DTERR6_FLAG  - EDMA_HDT6_FLAG   - EDMA_FDT6_FLAG
  *         - EDMA_FERR7_FLAG   - EDMA_DMERR7_FLAG  - EDMA_DTERR7_FLAG  - EDMA_HDT7_FLAG   - EDMA_FDT7_FLAG
  *         - EDMA_FERR8_FLAG   - EDMA_DMERR8_FLAG  - EDMA_DTERR8_FLAG  - EDMA_HDT8_FLAG   - EDMA_FDT8_FLAG
  * @retval none.
  */
void edma_flag_clear(uint32_t edma_flag)
{
  if(edma_flag > ((uint32_t)0x20000000))
  {
    EDMA->clr2 = (uint32_t)(edma_flag & 0x0FFFFFFF);
  }
  else
  {
    EDMA->clr1 = edma_flag;
  }
}

/**
  * @brief  initialize the edma 2d mode.
  * @param  edma_streamx_2d:
  *         this parameter can be one of the following values:
  *         - EDMA_STREAM1_2D
  *         - EDMA_STREAM2_2D
  *         - EDMA_STREAM3_2D
  *         - EDMA_STREAM4_2D
  *         - EDMA_STREAM5_2D
  *         - EDMA_STREAM6_2D
  *         - EDMA_STREAM7_2D
  *         - EDMA_STREAM8_2D
  * @param  src_stride: source stride(-32768 ~ 32767).
  * @param  dst_stride: destination stride(-32768 ~ 32767).
  * @param  xcnt: x dimension transfer count(0x0000~ 0xFFFF).
  * @param  ycnt: y dimension transfer count(0x0000~ 0xFFFF).
  * @retval none.
  */
void edma_2d_init(edma_stream_2d_type *edma_streamx_2d, int16_t src_stride, int16_t dst_stride, uint16_t xcnt, uint16_t ycnt)
{
  edma_streamx_2d->s2dcnt = (uint32_t)((ycnt << 16) | (xcnt));

  edma_streamx_2d->stride = (uint32_t)((dst_stride << 16) | (src_stride));
}

/**
  * @brief  enable or disable the edma 2d mode.
  * @param  edma_streamx_2d:
  *         this parameter can be one of the following values:
  *         - EDMA_STREAM1_2D
  *         - EDMA_STREAM2_2D
  *         - EDMA_STREAM3_2D
  *         - EDMA_STREAM4_2D
  *         - EDMA_STREAM5_2D
  *         - EDMA_STREAM6_2D
  *         - EDMA_STREAM7_2D
  *         - EDMA_STREAM8_2D
  * @param  new_state (TRUE or FALSE).
  * @retval none.
  */
void edma_2d_enable(edma_stream_2d_type *edma_streamx_2d, confirm_state new_state)
{
  uint32_t offset;

