RT-Thread/rt-thread/bsp/at32/libraries/f435_437/firmware/drivers/src/at32f435_437_edma.c
  offset = ((uint32_t)edma_streamx_2d - EDMA_STREAM1_2D_BASE) / 4;

  if(new_state != FALSE)
  {
    EDMA->s2dctrl |= (uint16_t)0x0001 << offset;
  }
  else
  {
    EDMA->s2dctrl &= ~((uint16_t)0x0001 << offset);
  }
}

/**
  * @brief  initialize the edma link list.
  * @param  edma_streamx_ll:
  *         this parameter can be one of the following values:
  *         - EDMA_STREAM1_LL
  *         - EDMA_STREAM2_LL
  *         - EDMA_STREAM3_LL
  *         - EDMA_STREAM4_LL
  *         - EDMA_STREAM5_LL
  *         - EDMA_STREAM6_LL
  *         - EDMA_STREAM7_LL
  *         - EDMA_STREAM8_LL
  * @param  pointer: link list pointer.
  * @retval none.
  */
void edma_link_list_init(edma_stream_link_list_type *edma_streamx_ll, uint32_t pointer)
{
  edma_streamx_ll->llp = pointer;
}

/**
  * @brief  enable or disable the edma stream link list mode.
  * @param  edma_streamx_ll:
  *         this parameter can be any combination of the following values:
  *         - EDMA_STREAM1_LL
  *         - EDMA_STREAM2_LL
  *         - EDMA_STREAM3_LL
  *         - EDMA_STREAM4_LL
  *         - EDMA_STREAM5_LL
  *         - EDMA_STREAM6_LL
  *         - EDMA_STREAM7_LL
  *         - EDMA_STREAM8_LL
  * @param  new_state (TRUE or FALSE).
  * @retval none.
  */
void edma_link_list_enable(edma_stream_link_list_type *edma_streamx_ll, confirm_state new_state)
{
  uint32_t offset;

  offset = ((uint32_t)edma_streamx_ll - EDMA_STREAM1_LL_BASE) / 4;

  if(new_state != FALSE)
  {
    EDMA->llctrl |= (uint16_t)0x0001 << offset;
  }
  else
  {
    EDMA->llctrl &= ~((uint16_t)0x0001 << offset);
  }
}

/**
  * @brief  enable or disable the edma edmamux.
  * @param  new_state (TRUE or FALSE).
  * @retval none.
  */
void edmamux_enable(confirm_state new_state)
{
  EDMA->muxsel_bit.tblsel = new_state;
}

/**
  * @brief  edmamux init.
  * @param  edmamux_channelx:
  *         this parameter can be one of the following values:
  *         - EDMAMUX_CHANNEL1
  *         - EDMAMUX_CHANNEL2
  *         - EDMAMUX_CHANNEL3
  *         - EDMAMUX_CHANNEL4
  *         - EDMAMUX_CHANNEL5
  *         - EDMAMUX_CHANNEL6
  *         - EDMAMUX_CHANNEL7
  *         - EDMAMUX_CHANNEL8
  * @param  edmamux_req_id:
  *         this parameter can be one of the following values:
  *         - EDMAMUX_DMAREQ_ID_REQ_G1       - EDMAMUX_DMAREQ_ID_REQ_G2       - EDMAMUX_DMAREQ_ID_REQ_G3       - EDMAMUX_DMAREQ_ID_REQ_G4
  *         - EDMAMUX_DMAREQ_ID_ADC1         - EDMAMUX_DMAREQ_ID_ADC2         - EDMAMUX_DMAREQ_ID_ADC3         - EDMAMUX_DMAREQ_ID_DAC1
  *         - EDMAMUX_DMAREQ_ID_DAC2         - EDMAMUX_DMAREQ_ID_TMR6_OVERFLOW- EDMAMUX_DMAREQ_ID_TMR7_OVERFLOW- EDMAMUX_DMAREQ_ID_SPI1_RX
  *         - EDMAMUX_DMAREQ_ID_SPI1_TX      - EDMAMUX_DMAREQ_ID_SPI2_RX      - EDMAMUX_DMAREQ_ID_SPI2_TX      - EDMAMUX_DMAREQ_ID_SPI3_RX
  *         - EDMAMUX_DMAREQ_ID_SPI3_TX      - EDMAMUX_DMAREQ_ID_SPI4_RX      - EDMAMUX_DMAREQ_ID_SPI4_TX      - EDMAMUX_DMAREQ_ID_I2S2_EXT_RX
  *         - EDMAMUX_DMAREQ_ID_I2S2_EXT_TX  - EDMAMUX_DMAREQ_ID_I2S3_EXT_RX  - EDMAMUX_DMAREQ_ID_I2S3_EXT_TX  - EDMAMUX_DMAREQ_ID_I2C1_RX
  *         - EDMAMUX_DMAREQ_ID_I2C1_TX      - EDMAMUX_DMAREQ_ID_I2C2_RX      - EDMAMUX_DMAREQ_ID_I2C2_TX      - EDMAMUX_DMAREQ_ID_I2C3_RX
  *         - EDMAMUX_DMAREQ_ID_I2C3_TX      - EDMAMUX_DMAREQ_ID_USART1_RX    - EDMAMUX_DMAREQ_ID_USART1_TX    - EDMAMUX_DMAREQ_ID_USART2_RX
  *         - EDMAMUX_DMAREQ_ID_USART2_TX    - EDMAMUX_DMAREQ_ID_USART3_RX    - EDMAMUX_DMAREQ_ID_USART3_TX    - EDMAMUX_DMAREQ_ID_UART4_RX
  *         - EDMAMUX_DMAREQ_ID_UART4_TX     - EDMAMUX_DMAREQ_ID_UART5_RX     - EDMAMUX_DMAREQ_ID_UART5_TX     - EDMAMUX_DMAREQ_ID_USART6_RX
  *         - EDMAMUX_DMAREQ_ID_USART6_TX    - EDMAMUX_DMAREQ_ID_UART7_RX     - EDMAMUX_DMAREQ_ID_UART7_TX     - EDMAMUX_DMAREQ_ID_UART8_RX
  *         - EDMAMUX_DMAREQ_ID_UART8_TX     - EDMAMUX_DMAREQ_ID_SDIO1        - EDMAMUX_DMAREQ_ID_SDIO2        - EDMAMUX_DMAREQ_ID_QSPI1
  *         - EDMAMUX_DMAREQ_ID_QSPI2        - EDMAMUX_DMAREQ_ID_TMR1_CH1     - EDMAMUX_DMAREQ_ID_TMR1_CH2     - EDMAMUX_DMAREQ_ID_TMR1_CH3
  *         - EDMAMUX_DMAREQ_ID_TMR1_CH4     - EDMAMUX_DMAREQ_ID_TMR1_OVERFLOW- EDMAMUX_DMAREQ_ID_TMR1_TRIG    - EDMAMUX_DMAREQ_ID_TMR1_COM
  *         - EDMAMUX_DMAREQ_ID_TMR8_CH1     - EDMAMUX_DMAREQ_ID_TMR8_CH2     - EDMAMUX_DMAREQ_ID_TMR8_CH3     - EDMAMUX_DMAREQ_ID_TMR8_CH4
  *         - EDMAMUX_DMAREQ_ID_TMR8_UP      - EDMAMUX_DMAREQ_ID_TMR8_TRIG    - EDMAMUX_DMAREQ_ID_TMR8_COM     - EDMAMUX_DMAREQ_ID_TMR2_CH1
  *         - EDMAMUX_DMAREQ_ID_TMR2_CH2     - EDMAMUX_DMAREQ_ID_TMR2_CH3     - EDMAMUX_DMAREQ_ID_TMR2_CH4     - EDMAMUX_DMAREQ_ID_TMR2_OVERFLOW
  *         - EDMAMUX_DMAREQ_ID_TMR2_TRIG    - EDMAMUX_DMAREQ_ID_TMR3_CH1     - EDMAMUX_DMAREQ_ID_TMR3_CH2     - EDMAMUX_DMAREQ_ID_TMR3_CH3
  *         - EDMAMUX_DMAREQ_ID_TMR3_CH4     - EDMAMUX_DMAREQ_ID_TMR3_OVERFLOW- EDMAMUX_DMAREQ_ID_TMR3_TRIG    - EDMAMUX_DMAREQ_ID_TMR4_CH1
  *         - EDMAMUX_DMAREQ_ID_TMR4_CH2     - EDMAMUX_DMAREQ_ID_TMR4_CH3     - EDMAMUX_DMAREQ_ID_TMR4_CH4     - EDMAMUX_DMAREQ_ID_TMR4_OVERFLOW
  *         - EDMAMUX_DMAREQ_ID_TMR4_TRIG    - EDMAMUX_DMAREQ_ID_TMR5_CH1     - EDMAMUX_DMAREQ_ID_TMR5_CH2     - EDMAMUX_DMAREQ_ID_TMR5_CH3
  *         - EDMAMUX_DMAREQ_ID_TMR5_CH4     - EDMAMUX_DMAREQ_ID_TMR5_OVERFLOW- EDMAMUX_DMAREQ_ID_TMR5_TRIG    - EDMAMUX_DMAREQ_ID_TMR20_CH1
  *         - EDMAMUX_DMAREQ_ID_TMR20_CH2    - EDMAMUX_DMAREQ_ID_TMR20_CH3    - EDMAMUX_DMAREQ_ID_TMR20_CH4    - EDMAMUX_DMAREQ_ID_TMR20_OVERFLOW
  *         - EDMAMUX_DMAREQ_ID_TMR20_TRIG   - EDMAMUX_DMAREQ_ID_TMR20_HALL   - EDMAMUX_DMAREQ_ID_DVP
  * @retval none.
  */
void edmamux_init(edmamux_channel_type *edmamux_channelx, edmamux_requst_id_sel_type edmamux_req_id)
{
  edmamux_channelx->muxctrl_bit.reqsel = edmamux_req_id;
}

/**
  * @brief  edmamux sync init struct config with its default value.
  * @param  edmamux_sync_init_struct: pointer to a edmamux_sync_init_type structure which will be initialized.
  * @retval none.
  */
void edmamux_sync_default_para_init(edmamux_sync_init_type *edmamux_sync_init_struct)
{
  edmamux_sync_init_struct->sync_enable = FALSE;
  edmamux_sync_init_struct->sync_event_enable = FALSE;
  edmamux_sync_init_struct->sync_polarity = EDMAMUX_SYNC_POLARITY_DISABLE;
  edmamux_sync_init_struct->sync_request_number = 0x0;
  edmamux_sync_init_struct->sync_signal_sel = EDMAMUX_SYNC_ID_EXINT0;
}

/**
  * @brief  edmamux synchronization config.
  * @param  edmamux_channelx:
  *         this parameter can be one of the following values:
  *         - EDMAMUX_CHANNEL1
  *         - EDMAMUX_CHANNEL2
  *         - EDMAMUX_CHANNEL3
  *         - EDMAMUX_CHANNEL4
  *         - EDMAMUX_CHANNEL5
  *         - EDMAMUX_CHANNEL6
  *         - EDMAMUX_CHANNEL7
  *         - EDMAMUX_CHANNEL8
  * @param  edmamux_sync_init_struct: ointer to a edmamux_sync_init_type structure.
  * @retval none.
  */
void edmamux_sync_config(edmamux_channel_type *edmamux_channelx, edmamux_sync_init_type *edmamux_sync_init_struct)
{
  edmamux_channelx->muxctrl_bit.syncsel = edmamux_sync_init_struct->sync_signal_sel;
  edmamux_channelx->muxctrl_bit.syncpol = edmamux_sync_init_struct->sync_polarity;
  edmamux_channelx->muxctrl_bit.reqcnt  = edmamux_sync_init_struct->sync_request_number;
  edmamux_channelx->muxctrl_bit.evtgen  = edmamux_sync_init_struct->sync_event_enable;
  edmamux_channelx->muxctrl_bit.syncen  = edmamux_sync_init_struct->sync_enable;
}

/**
  * @brief  edmamux request generator init struct config with its default value.
  * @param  edmamux_gen_init_struct: pointer to a edmamux_gen_init_type structure which will be initialized.
  * @retval none.
  */
void edmamux_generator_default_para_init(edmamux_gen_init_type *edmamux_gen_init_struct)
{
  edmamux_gen_init_struct->gen_enable         = FALSE;
  edmamux_gen_init_struct->gen_polarity       = EDMAMUX_GEN_POLARITY_DISABLE;
  edmamux_gen_init_struct->gen_request_number = 0x0;
  edmamux_gen_init_struct->gen_signal_sel     = EDMAMUX_GEN_ID_EXINT0;
}

/**
  * @brief  edmamux request generator init.
  * @param  edmamux_gen_init_struct: pointer to a edmamux_gen_init_type structure which will be initialized.
  * @retval none.
  */
void edmamux_generator_config(edmamux_generator_type *edmamux_gen_x, edmamux_gen_init_type *edmamux_gen_init_struct)
{
  edmamux_gen_x->gctrl_bit.sigsel  = edmamux_gen_init_struct->gen_signal_sel;
  edmamux_gen_x->gctrl_bit.gpol    = edmamux_gen_init_struct->gen_polarity;
  edmamux_gen_x->gctrl_bit.greqcnt = edmamux_gen_init_struct->gen_request_number;
  edmamux_gen_x->gctrl_bit.gen     = edmamux_gen_init_struct->gen_enable;
}

/**
  * @brief  enable or disable the edmamux sync interrupts.
  * @param  edmamux_channelx:
  *         this parameter can be one of the following values:
  *         - EDMAMUX_CHANNEL1
  *         - EDMAMUX_CHANNEL2
  *         - EDMAMUX_CHANNEL3
  *         - EDMAMUX_CHANNEL4
  *         - EDMAMUX_CHANNEL5
  *         - EDMAMUX_CHANNEL6
  *         - EDMAMUX_CHANNEL7
  *         - EDMAMUX_CHANNEL8
  * @param  new_state (TRUE or FALSE).
  * @retval none.
  */
void edmamux_sync_interrupt_enable(edmamux_channel_type *edmamux_channelx, confirm_state new_state)
{
  if(new_state != FALSE)
  {
    edmamux_channelx->muxctrl_bit.syncovien = TRUE;
  }
  else
  {
    edmamux_channelx->muxctrl_bit.syncovien = FALSE;
  }
}

/**
  * @brief  enable or disable the edmamux request generator interrupts.
  * @param  edmamux_gen_x: pointer to a edmamux_generator_type structure.
  *         this parameter can be one of the following values:
  *         - EDMAMUX_GENERATOR1
  *         - EDMAMUX_GENERATOR2
  *         - EDMAMUX_GENERATOR3
  *         - EDMAMUX_GENERATOR4
  * @param  new_state (TRUE or FALSE).
  * @retval none.
  */
void edmamux_generator_interrupt_enable(edmamux_generator_type *edmamux_gen_x, confirm_state new_state)
{
  if(new_state != FALSE)
  {
    edmamux_gen_x->gctrl_bit.trgovien = TRUE;
  }
  else
  {
    edmamux_gen_x->gctrl_bit.trgovien = FALSE;
  }
}

/**
  * @brief  edmamux sync flag get.
  * @param  flag
  *         this parameter can be any combination of the following values:
  *         - EDMAMUX_SYNC_OV1_FLAG
  *         - EDMAMUX_SYNC_OV2_FLAG
  *         - EDMAMUX_SYNC_OV3_FLAG
  *         - EDMAMUX_SYNC_OV4_FLAG
  *         - EDMAMUX_SYNC_OV5_FLAG
  *         - EDMAMUX_SYNC_OV6_FLAG
  *         - EDMAMUX_SYNC_OV7_FLAG
  *         - EDMAMUX_SYNC_OV8_FLAG
  * @retval state of edmamux sync flag.
  */
flag_status edmamux_sync_flag_get(uint32_t flag)
{
  if((EDMA->muxsyncsts & flag) != RESET)
  {
    return SET;
  }
  else
  {
    return RESET;
  }
}

/**
  * @brief  edmamux sync flag clear.
  * @param  flag
  *         this parameter can be any combination of the following values:
  *         - EDMAMUX_SYNC_OV1_FLAG
  *         - EDMAMUX_SYNC_OV2_FLAG
  *         - EDMAMUX_SYNC_OV3_FLAG
  *         - EDMAMUX_SYNC_OV4_FLAG
  *         - EDMAMUX_SYNC_OV5_FLAG
  *         - EDMAMUX_SYNC_OV6_FLAG
  *         - EDMAMUX_SYNC_OV7_FLAG
  *         - EDMAMUX_SYNC_OV8_FLAG
  * @retval none.
  */
void edmamux_sync_flag_clear(uint32_t flag)
{
  EDMA->muxsyncclr = flag;
}

/**
  * @brief  edmamux request generator flag get.
  * @param  flag
  *         this parameter can be any combination of the following values:
  *         - EDMAMUX_GEN_TRIG_OV1_FLAG
  *         - EDMAMUX_GEN_TRIG_OV2_FLAG
  *         - EDMAMUX_GEN_TRIG_OV3_FLAG
  *         - EDMAMUX_GEN_TRIG_OV4_FLAG
  * @retval state of edmamux sync flag.
  */
flag_status edmamux_generator_flag_get(uint32_t flag)
{
  if((EDMA->muxgsts & flag) != RESET)
  {
    return SET;
  }
  else
  {
    return RESET;
  }
}

/**
  * @brief  edmamux request generator flag clear.
  * @param  flag
  *         this parameter can be any combination of the following values:
  *         - EDMAMUX_GEN_TRIG_OV1_FLAG
  *         - EDMAMUX_GEN_TRIG_OV2_FLAG
  *         - EDMAMUX_GEN_TRIG_OV3_FLAG
  *         - EDMAMUX_GEN_TRIG_OV4_FLAG
  * @retval none.
  */
void edmamux_generator_flag_clear(uint32_t flag)
{
  EDMA->muxgclr = flag;
}

/**
  * @}
  */

#endif

/**
  * @}
  */

/**
  * @}
  */
